In [1]:
pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages (2.0.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\programdata\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd
import numpy as np

In [3]:
pd.__version__

'2.0.3'

In [4]:
#creating series

lst=[1,2,3,4]
pd.Series(lst)

0    1
1    2
2    3
3    4
dtype: int64

creating series through list

In [5]:
arr=np.array([1,2,3,4,6])
pd.Series(arr)

0    1
1    2
2    3
3    4
4    6
dtype: int32

creating series using numpy arrays

In [6]:
pd.Series(data=['Eshant','akash','bikash'], index=[1,2,3])

1    Eshant
2     akash
3    bikash
dtype: object

giving index form our own end

In [7]:
steps={'day_1':6000, 'day_2':4000, 'day_3':6700}
pd.Series(steps)

day_1    6000
day_2    4000
day_3    6700
dtype: int64

series being defined using dictionary

In [8]:
lst=[1,2]
pd.Series(lst).repeat(5)

0    1
0    1
0    1
0    1
0    1
1    2
1    2
1    2
1    2
1    2
dtype: int64

creating series using repeat function but index doesnt change here

In [9]:
lst=[1,2]
pd.Series(lst).repeat(5).reset_index()

   index  0
0      0  1
1      0  1
2      0  1
3      0  1
4      0  1
5      1  2
6      1  2
7      1  2
8      1  2
9      1  2

reseting the index but one index colmn has been added

In [10]:
lst=[1,2]
pd.Series(lst).repeat(5).reset_index(drop=True)

0    1
1    1
2    1
3    1
4    1
5    2
6    2
7    2
8    2
9    2
dtype: int64

the extra colmn has been deleted

In [11]:
pd.Series([10,12]).repeat([3,2])

0    10
0    10
0    10
1    12
1    12
dtype: int64

10 rpeeating for 3 times while 12 is doing it for 2 times

In [12]:
s=pd.Series([10,12]).repeat([3,2]).reset_index(drop=True)

#### Accessing the elements:

In [13]:
s

0    10
1    10
2    10
3    12
4    12
dtype: int64

In [14]:
s[3]

12

In [15]:
s[12]

KeyError: 12

In [ ]:
s[:]

In [ ]:
s[2:4]

### aggregate function on pandas series:

In [ ]:
sr=pd.Series([1,2,3,56,7])
sr.agg([min,max,sum])

In [ ]:
sr=pd.Series([1,2,-3,-56,-7])
sr.abs()

returns the absolute value

### Appending series

In [ ]:
sr1=pd.Series([1,2,3,56,7])
sr2=pd.Series([1,2,-3,-56,-7])

sr1,sr2

In [ ]:
sr3=sr1.append(sr2)

appending not working

### Astype function

In [ ]:
sr1

In [ ]:
type(sr1[0])

In [ ]:
sr1.astype('float')

In [ ]:
sr2.astype('string')

### Between function:

checks whic values lie between first and last.

In [ ]:
sr1=pd.Series([1,2,3,4,5,7,8,9,6])

In [ ]:
sr1.between(2,6)

# Strings:

1.upper and lower function
2.len function
3.strip function
4.contains function
5.replace function
6.count function
7.startswith and ednswith function
8.find function

In [16]:
ser=pd.Series(["Eshan Das","data science", "geeks for geeks","Hello world","Machine Learning"])

In [18]:
ser

0           Eshan Das
1        data science
2     geeks for geeks
3         Hello world
4    Machine Learning
dtype: object

In [23]:
print(ser.str.upper())
print("-"*50)
print(ser.str.lower())

0           ESHAN DAS
1        DATA SCIENCE
2     GEEKS FOR GEEKS
3         HELLO WORLD
4    MACHINE LEARNING
dtype: object
--------------------------------------------------
0           eshan das
1        data science
2     geeks for geeks
3         hello world
4    machine learning
dtype: object

In [25]:
for i in ser:
    print(len(i))

9
12
15
11
16

In [29]:
ser=pd.Series(["Eshan Das     ","data science", "geeks for geeks","Hello world  ","Machine Learning"])
for i in ser:
    print(i, len(i))

Eshan Das      14
data science 12
geeks for geeks 15
Hello world   13
Machine Learning 16

In [31]:
ser=ser.str.strip()
for i in ser:
    print(i, len(i))

Eshan Das 9
data science 12
geeks for geeks 15
Hello world 11
Machine Learning 16

In [35]:
ser.str.split()

0           [Eshan, Das]
1        [data, science]
2    [geeks, for, geeks]
3         [Hello, world]
4    [Machine, Learning]
dtype: object

In [42]:
pd.Series(["12/2/1912","3/2/2034","4/2/2056"]).str.split("/")[1]

['3', '2', '2034']

In [44]:
ser.str.split()[2]

['geeks', 'for', 'geeks']

### Contain function:

In [47]:
ser=pd.Series(["Eshan@Das","data science", "geeks for geeks","Hello@world","Machine Learning"])

In [49]:
ser.str.contains("@")

0     True
1    False
2    False
3     True
4    False
dtype: bool

In [52]:
ser.str.replace("@"," ")

0           Eshan Das
1        data science
2     geeks for geeks
3         Hello world
4    Machine Learning
dtype: object

In [54]:
ser.str.count('a')

0    2
1    2
2    0
3    0
4    2
dtype: int64

In [56]:
ser.str.endswith('s')

0     True
1    False
2     True
3    False
4    False
dtype: bool

In [58]:
ser.str.startswith('a')

0    False
1    False
2    False
3    False
4    False
dtype: bool

#### Find Fucntion:

In [60]:
ser.str.find("Das")

0    6
1   -1
2   -1
3   -1
4   -1
dtype: int64

### Converting a series to list:

In [61]:
ser.to_list()

['Eshan@Das',
 'data science',
 'geeks for geeks',
 'Hello@world',
 'Machine Learning']

In [63]:
type(ser.to_list)

method

### Creating a data frame:

In [64]:
lst=["Geeks","for","geeks","is","a","portal","for","geeks"]

In [66]:
pd.DataFrame(lst)

        0
0   Geeks
1     for
2   geeks
3      is
4       a
5  portal
6     for
7   geeks

In [68]:
type(pd.DataFrame(lst))

pandas.core.frame.DataFrame

In [72]:
lst1=[["Anumoy Majhi",23,"RKM"],["Karan Singh",17,"KBH"],["Niggesh",34,"Harvard University"]]
pd.DataFrame(lst1)

              0   1                   2
0  Anumoy Majhi  23                 RKM
1   Karan Singh  17                 KBH
2       Niggesh  34  Harvard University

In [79]:
data={'Name':["Anumoy","Karan","Niggesh"], 
      'Age':[24,17,34], 
      'University':["BU","N/A","HU"],
     'Backlog':[22,'N/A',0]}
pd.DataFrame(data)

      Name  Age University Backlog
0   Anumoy   24         BU      22
1    Karan   17        N/A     N/A
2  Niggesh   34         HU       0

In [82]:
df=pd.DataFrame(data)
df[['Name','Backlog']]

      Name Backlog
0   Anumoy      22
1    Karan     N/A
2  Niggesh       0

#### Slicing in DataFrame suing loc and iloc:

In [87]:
data={'one':pd.Series([1,2,3,4]),
     'two':pd.Series([10,20,30,40]),
     'three':pd.Series([100,200,300,400]),
     'four':pd.Series([1000,2000,3000,4000])}

df=pd.DataFrame(data)

In [95]:
df.loc[1:2]
df.loc[1:2,'two':'three']

   two  three
1   20    200
2   30    300

In [106]:
df.iloc[1:-1,1:-1]

   two  three
1   20    200
2   30    300

In [113]:
df.iloc[:,2:3]

   three
0    100
1    200
2    300
3    400

In [116]:
df.iloc[2:3,:]

   one  two  three  four
2    3   30    300  3000

In [118]:
df.iloc[[0,2],[1,3]]

   two  four
0   10  1000
2   30  3000

##### Slicing using conditions:

In [123]:
df.loc[df['two']>20,['three','four']]

   three  four
2    300  3000
3    400  4000

In [129]:
df.loc[df['three']<200, ['one','four']]

   one  four
0    1  1000

In [131]:
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [133]:
l=[22,33,44,55]
df['five']=l
df

   one  two  three  four  five
0    1   10    100  1000    22
1    2   20    200  2000    33
2    3   30    300  3000    44
3    4   40    400  4000    55

In [135]:
ser=pd.Series([222,333,444,555])
df['six']=ser
df

   one  two  three  four  five  six
0    1   10    100  1000    22  222
1    2   20    200  2000    33  333
2    3   30    300  3000    44  444
3    4   40    400  4000    55  555

In [138]:
df['seven']=df['one']+100000
df

   one  two  three  four  five  six   seven
0    1   10    100  1000    22  222  100001
1    2   20    200  2000    33  333  100002
2    3   30    300  3000    44  444  100003
3    4   40    400  4000    55  555  100004